
import { Metadata } from "next";

export const metadata: Metadata = {
    title: "Реєстрація Нового Користувача | Croco Sushi Львів",
    description: "Створіть акаунт Croco Sushi. Швидке замовлення, історія покупок та бонусна програма.",
    robots: {
        index: true,
        follow: true,
    },
    alternates: {
        canonical: "https://crocosushi.com/register",
    }
};

export default function RegisterLayout({
    children,
}: {
    children: React.ReactNode;
}) {
    return (
        <>
            <div className="sr-only">
                <h2>Реєстрація в Croco Sushi - Доставка Суші Львів</h2>
                <p>
                    Станьте частиною родини Croco Sushi! Реєстрація на нашому сайті займе всього кілька хвилин, але відкриє перед вами світ смачних переваг та зручності.
                    Створивши акаунт, ви отримуєте можливість швидкого замовлення улюблених суші та ролів у Львові без зайвого клопоту.

                    Чому варто зареєструватися:
                    1. Участь у бонусній програмі: отримуйте кешбек з кожного замовлення та розраховуйтесь бонусами.
                    2. Персональні пропозиції: отримуйте ексклюзивні знижки та промокоди, доступні тільки зареєстрованим користувачам.
                    3. Збереження історії: легко повторюйте свої улюблені замовлення.
                    4. Керування адресами: зберігайте адреси дому та роботи для швидкого вибору.

                    Croco Sushi – це преміум якість за доступною ціною. Ми використовуємо тільки добірні інгредієнти для приготування наших страв.
                    Спробуйте наші фірмові роли, нігірі, гункани та великі сети для святкувань.
                    Доставка здійснюється по всьому Львову. Ми дбаємо про якість та свіжість кожного шматочка.
                    Приєднуйтесь до нас сьогодні та насолоджуйтесь справжнім смаком Японії у вас вдома.
                    Заповніть просту форму реєстрації, вказавши свій телефон, ім&apos;я та пароль. Ваші дані надійно захищені.
                </p>
            </div>
            {children}
        </>
    );
}
